"""
ให้เขียนโปรแกรมภาษา Python สำหรับจำลองระบบสั่งอาหาร โดยมีรายละเอียดดังนี้ โปรแกรมต้องสร้างฟังก์ชัน menu() เพื่อใช้แสดงหน้าเมนูหลัก ผู้ใช้จะต้องกำหนดจำนวนเงินเริ่มต้นก่อน จากนั้นจึงสามารถเข้าสู่หน้าเมนูอาหารเพื่อเลือกซื้อรายการต่างๆ ได้ โดยอาหารแต่ละรายการต้องมีราคากำกับ และเมื่อผู้ใช้เลือกซื้อ เงินคงเหลือจะถูกหักออกตามราคาของอาหารที่เลือก
โปรแกรมต้องสามารถทำงานซ้ำได้หลายครั้ง และต้องจัดการเงื่อนไขต่อไปนี้ให้ถูกต้อง
- แสดงยอดเงินคงเหลือหลังการซื้อทุกครั้ง
- ไม่อนุญาตให้ซื้ออาหารในกรณีที่เงินไม่เพียงพอ
- หากเงินคงเหลือหมด โปรแกรมต้องสอบถามผู้ใช้ว่าต้องการเพิ่มเงินเพื่อซื้อสินค้าต่อหรือไม่
- หากผู้ใช้เลือกเพิ่มเงิน ให้รับจำนวนเงินใหม่แล้วนำไปบวกกับเงินคงเหลือ แต่หากไม่เพิ่มให้โปรแกรมสิ้นสุดการทำงานอย่างเหมาะสม

NOTE: หน้าที่แสดงในตัวอย่างเป็นแค่บางส่วนเท่านั้น ทำให้อาจจะมีบางหน้าที่ต้องทำเอง

Main-page Example
--------------------
- menu page
      MENU
================
1) Balance
2) Food
4) Quit
================
--------------------
- Balance 
     BALANCE
=================
Name: <name>
Budget: $$$
Remaining: $$$
=================
--------------------
- quit = End the program.
"""